{
    "StudentMathScore": {
        "1": "Federal Revenue Data (Questions about federal revenue information related to different states and school districts)",
        "2": "Math Score Data (Questions about the average math scores in different states for grade 8 students)",
        "3": "Revenue Key Data (Questions about the number of records for each state in the federal revenue data)"
    },
    "USWildFires": {
        "1": "Fire Statistics (Questions focusing on the details of the fires themselves such as size, location, year and cause)",
        "2": "Fire Discovery and Containment (Questions relating to the discovery and containment details of the fires)",
        "3": "Fire Ownership (Questions about the ownership of the land where the fire occurred)",
        "4": "Geographical Details (Questions about the geographical details such as state, county, latitude and longitude)",
        "5": "FIPS Code and Name (Questions specifically about FIPS codes and names)"
    },
    "WorldSoccerDataBase": {
        "1": "Betting Odds Analysis (Questions focusing on the opening and closing betting odds for each match in different countries and competitions)",
        "2": "Match Results Evaluation (Questions related to the final and half-time results of the matches, home and away teams statistics)",
        "3": "Referee Performance Analysis (Questions targeting the impact of referees on the match outcomes)",
        "4": "Seasonal Trends Investigation (Questions regarding the trends and patterns across different football seasons)",
        "5": "League Performance Comparison (Questions comparing the performance of teams in different leagues and countries)"
    },
    "TheHistoryofBaseball": {
        "1": "Hall of Fame Inductees Information (Questions related to the players inducted into the Hall of Fame, year of induction, category and voter details)",
        "2": "Player Awards History (Questions related to the awards received by players, award details, year of award, and associated notes)",
        "3": "Player Award Voting Details (Questions related to the voting process for player awards, including the points won and maximum points)",
        "4": "Player Salary Information (Questions related to players' salaries, team details, and associated league)",
        "5": "Player Personal Details (Questions related to the personal information of players including birth and death details, name, and physical attributes)"
    },
    "Pesticide": {
        "1": "Sample Data Information (Questions specifically related to the sample data, such as information about the state, year, month, day, site, commodity, source ID, and the like. Avoid questions related to results data)",
        "2": "Results Data Information (Questions specifically related to the results data, such as information about the lab, pesticide code, test class, concentration, limit of detection, and the like. Avoid questions related to the sample data)",
        "3": "Data Relationship (Questions specifically related to how the sample data and results data relate to each other, such as how the sample primary key is used in both tables, how commodity and commodity type are used in both tables, etc.)"
    },
    "GreaterManchesterCrime": {
        "1": "Crime Type Information (Questions specifically related to different types of crimes. Avoid questions related to crime locations or outcomes)",
        "2": "Crime Location Information (Questions specifically related to crime locations. Avoid questions related to types of crimes or outcomes)",
        "3": "Crime Outcome Information (Questions specifically related to crime outcomes. Avoid questions related to types of crimes or locations)",
        "4": "Crime Timestamp Information (Questions specifically related to the timestamps of crimes. Avoid questions related to types of crimes, locations or outcomes)",
        "5": "LSOA Information (Questions specifically related to the LSOA value of crimes. Avoid questions related to types of crimes, locations, outcomes or timestamps)"
    },
    "GeoNuclearData": {
        "1": "Nuclear Power Plant Information (Questions specifically related to the nuclear power plants, including their names, locations, and capacity)",
        "2": "Reactor Information (Questions specifically related to the reactors, including their type and model)",
        "3": "Operational Data (Questions specifically related to the operational data of the nuclear power plants, including the construction start date, operational period, and last updated date)",
        "4": "Country-specific Information (Questions specifically related to the nuclear power plants in specific countries)",
        "5": "Status of Nuclear Power Plants (Questions specifically related to the current status of the nuclear power plants)",
        "6": "Source of Information (Questions specifically related to the source of the data in the database)"
    },
    "WhatCDHipHop": {
        "1": "Torrents Information (Questions related to the torrents, such as the artist, release type, and year. Avoid questions related to tags)",
        "2": "Artist Information (Questions focused on the artists in the torrents table. Avoid questions related to tags or other aspects of the torrents)",
        "3": "Tags Information (Questions specifically about the tags associated with the torrents. Avoid questions related to the specific details of the torrents)",
        "4": "Yearly Release Information (Questions related to the year of release for the torrents. Avoid questions related to tags or artists)",
        "5": "Release Type Information (Questions about the type of release for the torrents. Avoid questions about artists, tags, or year of release)"
    }
}